# 1. Ввод размерности системы
n = int(input("Введите количество уравнений n: "))
# 2. Ввод коэффициентов
print(f"\nВведите коэффициенты матрицы A ({n}x{n}):")
A = []
for i in range(n):
    row = []
    for j in range(n):
        a_ij = float(input(f"a[{i+1}][{j+1}] = "))
        row.append(a_ij)
    A.append(row)

print("\nВведите правые части B:")
B = []
for i in range(n):
    b_i = float(input(f"b[{i+1}] = "))
    B.append(b_i)

# Сохраняем исходную систему для проверки
A_src = [row[:] for row in A]
B_src = B[:]

# прямой ход (исключение переменных)
for i in range(n-1):
    # Проверка на ноль на главной диагонали
    if A[i][i] == 0:
        # Ищем строку с ненулевым элементом
        for k in range(i+1, n):
            if not A[k][i] == 0:
                # Перестановка строк
                A[i], A[k] = A[k], A[i]
                B[i], B[k] = B[k], B[i]
                break
    
    # Исключение переменной из следующих уравнений
    for j in range(i+1, n):
        m = A[j][i] / A[i][i]  # множитель
        if m == 0: continue
        for k in range(i, n):
            A[j][k] -= m * A[i][k]
        
        B[j] -= m * B[i]

# обратный ход
X = [0] * n

print("\nX1\tX2\tX3\tX4\t| B")
for i in range(len(A)):
    for j in A[i]:
        print(f"{j:.2f}", end="\t")
    print(f"| {B[i]:.2f}")

print("")

# Последняя переменная
X[n-1] = B[n-1] / A[n-1][n-1]

# Остальные переменные
for i in range(n-2, -1, -1):
    s = B[i]
    for j in range(i+1, n):
        s = s - A[i][j] * X[j]
    X[i] = s / A[i][i]

# ВЫВОД РЕЗУЛЬТАТОВ
print("Решение системы:")
for i in range(n):
    print(f"x{i+1} = {X[i]:.2f}")

print("\nпроверка:")
for i in range(n):
    check = 0
    for j in range(n):
        check = check + A_src[i][j] * X[j]
    print(f"Уравнение {i+1}: {check:.2f} = {B_src[i]}")

# Введите количество уравнений n: 4

# Введите коэффициенты матрицы A (4x4):
# a[1][1] = 6.0
# a[1][2] = -2.0
# a[1][3] = 1.0
# a[1][4] = 0.0
# a[2][1] = 2.0
# a[2][2] = 0.0
# a[2][3] = -5.0
# a[2][4] = 2.0
# a[3][1] = 0.0
# a[3][2] = 3.0
# a[3][3] = 2.0
# a[3][4] = 5.0
# a[4][1] = 2.0
# a[4][2] = -5.0
# a[4][3] = 2.0
# a[4][4] = 0.0

# Введите правые части B:
# b[1] = 0.0
# b[2] = -4.0
# b[3] = 22.0
# b[4] = -1.0

# X1      X2      X3      X4      | B
# 6.00    -2.00   1.00    0.00    | 0.00
# 0.00    0.67    -5.33   2.00    | -4.00
# 0.00    0.00    26.00   -4.00   | 40.00
# 0.00    0.00    0.00    7.92    | 23.77

# Решение системы:
# x1 = 0.00
# x2 = 1.00
# x3 = 2.00
# x4 = 3.00

# проверка:
# Уравнение 1: 0.00 = 0.0
# Уравнение 2: -4.00 = -4.0
# Уравнение 3: 22.00 = 22.0
# Уравнение 4: -1.00 = -1.0
